{
  "id": "11787448",
  "type": "article",
  "workspace_id": "o3ohuxro",
  "parent_id": null,
  "parent_type": null,
  "parent_ids": [
    13999473
  ],
  "tags": {
    "type": "tag.list",
    "tags": []
  },
  "title": "Elevated Profiles",
  "description": "From request to support",
  "body": "<p class=\"no-margin\"></p>\n<h1 id=\"h_8664da027a\">Explanation</h1><p class=\"no-margin\"></p>\n<p class=\"no-margin\">Elevated Profiles are confirmed and completed by a Hatch prospect researcher. Every All Profiles\" blankElevated Profiles\" blankprofile datapoint is confirmed manually and any missing data that is available on the web is added.</p><p class=\"no-margin\"></p>\n<h1 id=\"h_0017e34f4f\">Request</h1><p class=\"no-margin\"></p>\n<p class=\"no-margin\">Request any Hatch All Profiles\" blankElevated Profiles\" blankprofile to be Elevated by selecting the Elevated All Profiles\" blankElevated Profiles\" blankprofile button at the top of every donor All Profiles\" blankElevated Profiles\" blankprofile. A form will open on the left with optional questions. The more information you provide, the better results you will see upon Elevation completion. Once you've answered all questions possible, scroll to the form's bottom and select \"Send\".</p><p class=\"no-margin\"></p>\n<h1 id=\"h_01ea6dc635\">Turnaround Time</h1><p class=\"no-margin\"></p>\n<p class=\"no-margin\">Elevated Profiles are expected to be turned around in 2 business from the day they are requested. In cases where the prospect researcher is challenged to complete the Elevation, you will be notified. See \"Issue &amp; Delays\" below.</p><p class=\"no-margin\"></p>\n<h1 id=\"h_e1bd4f6000\">Email Notifications</h1><p class=\"no-margin\"></p>\n<p class=\"no-margin\">Once Elevated Profiles are complete, an email notification is sent to all users on the Troubleshooting Login Email Issues and User Access\" blankaccount setup\" blankTroubleshooting Login Email Issues and User Access\" blankaccount. The email includes key details about the Hatch person, including a link directly to the Hatch All Profiles\" blankElevated Profilesprofile.</p><p class=\"no-margin\"></p>\n<h1 id=\"h_1b9baf67d7\">AI Scoring &amp; Insights</h1><p class=\"no-margin\"></p>\n<p class=\"no-margin\">All Elevated Profiles contain updated AI Scoring &amp; Insights. Further edits made to the All Profiles\" blankElevated Profiles\" blankprofile will rerun Scoring with the same 10 minute mechanism described in the \"AI Scoring &amp; Insights\" article.</p><p class=\"no-margin\"></p>\n<h1 id=\"h_6fde171eb3\">EP Filters</h1><p class=\"no-margin\"></p>\n<p class=\"no-margin\">Filter for \"Elevated\" or \"Elevating\" profiles on both the All Profiles page or any list. Elevated Profiles filters are in the bottom filter section \"Prospect Management\".</p><p class=\"no-margin\"></p>\n<h1 id=\"h_814bf5eee5\">Usage</h1><p class=\"no-margin\"></p>\n<p class=\"no-margin\">Elevated Profiles only count against your monthly quota once they are complete. Any requested EPs that exceed your available quota will be fulfilled in the next quota period. Your monthly quotas reset to 0 on the day of the month your subscription began.</p><p class=\"no-margin\"></p>\n<h1 id=\"h_aaad925c43\">Issues &amp; Delays</h1><p class=\"no-margin\"></p>\n<p class=\"no-margin\">Researching people is a nuanced task. Where complexities arise, a ticket will be opened in Intercom (our in-app chat), notifying you of the possible delay. We may ask you for additional information on the person. We do our best to set expectations around when the All Profiles\" blankElevated Profiles\" blankprofile will be sent out.</p><p class=\"no-margin\"></p>\n<h1 id=\"h_fd79a1bd70\">Managing Your EP Queue</h1><p class=\"no-margin\"></p>\n<p class=\"no-margin\">Unfortunately, we are still building our capability to edit your EP queue. Stay tuned for our periodic product updates for the EP queue feature release.</p><p class=\"no-margin\"></p>",
  "author_id": 6409529,
  "state": "published",
  "created_at": 1752697346,
  "updated_at": 1755727152,
  "url": "https://intercom.help/hatch-giving-intelligence/en/articles/11787448-elevated-profiles"
}